{
  "Comment.nvim": { "branch": "master" },
  "austere.vim": { "branch": "master" },
  "base16-vim": { "branch": "master" },
  "bigfile.nvim": { "branch": "main" },
  "coc.nvim": { "branch": "master" },
  "gitsigns.nvim": { "branch": "main" },
  "hlchunk.nvim": { "branch": "main" },
  "kanagawa.nvim": { "branch": "master" },
  "komau.vim": { "branch": "master" },
  "lake.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "lush.nvim": { "branch": "main" },
  "marks.nvim": { "branch": "master" },
  "nord.nvim": { "branch": "main" },
  "nordern.nvim": { "branch": "master" },
  "nordic.nvim": { "branch": "main" },
  "nvim-hlslens": { "branch": "main" },
  "nvim-spectre": { "branch": "master" },
  "nvim-surround": { "branch": "main" },
  "nvim-treesitter": { "branch": "main" },
  "onenord.nvim": { "branch": "main" },
  "outline.nvim": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "rasmus.nvim": { "branch": "main" },
  "skull-vim": { "branch": "master" },
  "solarized.nvim": { "branch": "main" },
  "telescope-coc.nvim": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "todo-comments.nvim": { "branch": "main" },
  "vague.nvim": { "branch": "main" },
  "vim-peekaboo": { "branch": "master" },
  "vim-yin-yang": { "branch": "master" },
  "yui": { "branch": "master" },
  "zenbones.nvim": { "branch": "main" }
}
